[
  {
    "name": "MERN Stack Application with Admin Panel",
    "desc": "The project implements user registration, login, and logout functionalities using bcryptjs for password hashing, jsonwebtoken for token-based authentication, and mongoose for user data storage. Utilized Sanity IO (Headless CMS) for storing and managing blog posts. React-based frontend with routing, styling, and interactive elements. User experience enhanced with toasts and visual feedback.",
    "image": "mern-stack-app",
    "category": "mern",
    "links": {
      "view": "https://www.ridescom.com/",
      "code": "your_github_repo_link"
    }
  },
  {
    "name": "Android Application for Managing Academics",
    "desc": "Designed a backend database to store and manage a comprehensive collection of more than 1000+ CAT's and FAT's exam papers. Incorporated secure authentication and authorization mechanisms using Firebase Authentication. Effectively managed dependencies using Gradle, incorporating various libraries to enhance app functionality and user experience.",
    "image": "android-app",
    "category": "android",
    "links": {
      "view": "#",
      "code": "your_github_repo_link"
    }
  },
  {
    "name": "Smart Object Detection System",
    "desc": "Engineered OpenCV's deep learning-based object detection algorithms to optimize performance on the ESP32 CAM's embedded hardware. Integrated image processing pipelines to enable seamless real-time analysis of video streams from ESP32 CAM's built-in camera. Developed a real-time video processing pipeline using OpenCV's VideoCapture API.",
    "image": "object-detection",
    "category": "basicweb",
    "links": {
      "view": "#",
      "code": "your_github_repo_link"
    }
  },
  {
    "name": "Dynamic Exam Paper Distribution System",
    "desc": "Developed a web application and Android system for dynamic exam paper distribution. Features include: uploading question papers to AWS S3, automated thumbnail creation, real-time data synchronization with Firebase (using JSON), and instant availability of papers on the Last One Android app.",
    "image": "dynamic-exam-paper",
    "category": "android",
    "links": {
      "view": "#",
      "code": "your_github_repo_link"
    }
  },
  {
    "name": "Optimized Train Seat Allocation System",
    "desc": "Developed a MERN stack train seat management system that enables users to easily book seats with intelligent allocation logic. Features include real-time seat availability, prioritized in-row booking, a seven-seat booking limit, and a user-friendly interface built with React. MongoDB efficiently stores and manages seat data.",
    "image": "train-seat-allocation",
    "category": "mern",
    "links": {
      "view": "#",
      "code": "your_github_repo_link"
    }
  },
  {
    "name": "Kanban Board",
    "desc": "A React.js-based Kanban Board designed to help teams manage tasks efficiently by organizing them based on status, user, or priority. It’s visually inspired by the Kanban methodology, offering an intuitive way to track and prioritize tasks.",
    "image": "kanban-board",
    "category": "mern",
    "links": {
      "view": "#",
      "code": "your_github_repo_link"
    }
  },
  {
    "name": "Data Processing API and Frontend: Full Stack Project",
    "desc": "Created a full-stack application with a REST API for processing and filtering data, and a user-friendly frontend for data visualization. Project completed for a developer assessment (Qualifier Round).",
    "image": "data-processing-api",
    "category": "fullstack",
    "links": {
      "view": "#",
      "code": "your_github_repo_link"
    }
  },
  {
    "name": "A Simple Version of a TODO APP",
    "desc": "It is a todo app built on MERN Stack, performs simple CURD Operation.",
    "image": "todo-app",
    "category": "mern",
    "links": {
      "view": "https://gaurav-todo.onrender.com/",
      "code": "your_github_repo_link"
    }
  }
]